### Modelagem e normalização de bancos de dados relacionais

Tabela 1

Nome da tabela: cliente
Colunas: codigo_cliente, nome_cliente, sobrenome_cliente, telefones_cliente, municipio_cliente, codigo_tipo_cliente, tipo_cliente

Tabela 2

Nome da tabela: produto
Colunas: codigo_produto, nome_produto, descricao_produto, codigo_tipo_produto, tipo_produto, codigo_diretor_responsavel, nome_diretor_responsavel, email_diretor_responsavel

**1) Ainda sem fazer normalizações, apresente o modelo conceitual deste esboço oferecido pelo gestor, destacando atributos chaves e multivalorados, caso existam, e apresentando também a cardinalidade dos relacionamentos.**

**2) Agora apresente um modelo lógico que expresse as mesmas informações e relacionamentos descritos no modelo original, mas decompondo-os quando necessário para que sejam respeitadas as 3 primeiras formas normais. Destaque atributos chaves e multivalorados, caso existam, e apresente também a cardinalidade dos relacionamentos.**

### Consultas SQL simples e complexas em um banco de dados postgres

In [ ]:
CREATE TABLE prova.produtos (
    id SERIAL PRIMARY KEY,
    nome VARCHAR(100) NOT NULL,
    preco DECIMAL(10, 2) NOT NULL
);

CREATE TABLE prova.categorias (
    id SERIAL PRIMARY KEY,
    nome VARCHAR(100) NOT NULL
);

CREATE TABLE prova.produtos_categorias (
    produto_id INTEGER REFERENCES prova.produtos(id),
    categoria_id INTEGER REFERENCES prova.categorias(id),
    PRIMARY KEY (produto_id, categoria_id)
);

In [ ]:
-- Inserindo produtos eletrônicos
INSERT INTO prova.produtos (nome, preco)
VALUES
    ('Smartphone', 599.99),
    ('Notebook', 999.99),
    ('Fone de Ouvido', 49.99);

-- Inserindo produtos de roupas
INSERT INTO prova.produtos (nome, preco)
VALUES
    ('Camiseta', 19.99),
    ('Calça Jeans', 39.99),
    ('Sapato', 59.99);

-- Inserindo produtos alimentícios
INSERT INTO prova.produtos (nome, preco)
VALUES
    ('Arroz', 2.99),
    ('Feijão', 1.99),
    ('Macarrão', 1.49);

In [ ]:
INSERT INTO prova.categorias (nome)
VALUES
    ('Eletrônicos'),
    ('Roupas'),
    ('Alimentos');

INSERT INTO prova.produtos_categorias (produto_id, categoria_id)
VALUES
    (1, 1),
    (2, 1),
    (3, 1),
    (4, 2),
    (5, 2),
    (6, 2),
    (7, 3),
    (8, 3),
    (9, 3);

**3) Liste os nomes de todos os produtos que custam mais de 100 reais, ordenando-os primeiramente pelo preço e em segundo lugar pelo nome. Use alias para mostrar o nome da coluna nome como "Produto" e da coluna preco como "Valor". A resposta da consulta não deve mostrar outras colunas de dados.**

In [21]:
import pandas as pd 
import pandasql as ps
from sqlalchemy import create_engine

In [22]:
# SGBD://USER:SENHA@HOST/DATABASE

SGBD = "postgresql+psycopg2"
USER = "postgres"
SENHA = "123"
HOST = "localhost"
DATABASE = "postgres"

engine = create_engine(f"{SGBD}://{USER}:{SENHA}@{HOST}/{DATABASE}")
conn = engine.connect()

query = """
SELECT 
    nome AS "Produto",
    preco AS "Valor"
FROM prova.produtos
WHERE preco > 0
ORDER BY preco, nome
LIMIT 10
"""
df = pd.read_sql_query(query, con = conn)
df

          Produto   Valor
0        Macarrão    1.49
1          Feijão    1.99
2           Arroz    2.99
3        Camiseta   19.99
4     Calça Jeans   39.99
5  Fone de Ouvido   49.99
6          Sapato   59.99
7      Smartphone  599.99
8        Notebook  999.99

**4) Liste todos os ids e preços de produtos cujo preço seja maior do que a média de todos os preços encontrados na tabela "produtos".**

In [23]:
# SGBD://USER:SENHA@HOST/DATABASE

SGBD = "postgresql+psycopg2"
USER = "postgres"
SENHA = "123"
HOST = "localhost"
DATABASE = "postgres"

engine = create_engine(f"{SGBD}://{USER}:{SENHA}@{HOST}/{DATABASE}")
conn = engine.connect()

query = """
SELECT 
    id,
    preco AS "Valor"
FROM prova.produtos
WHERE preco > (SELECT AVG(preco) FROM ada.produtos)
LIMIT 10
"""
df = pd.read_sql_query(query, con = conn)
df

   id   Valor
0   1  599.99
1   2  999.99

**5) Para cada categoria, mostre o preço médio do conjunto de produtos a ela associados. Caso uma categoria não tenha nenhum produto a ela associada, esta categoria não deve aparecer no resultado final. A consulta deve estar ordenada pelos nomes das categorias.**

In [24]:
# SGBD://USER:SENHA@HOST/DATABASE

SGBD = "postgresql+psycopg2"
USER = "postgres"
SENHA = "123"
HOST = "localhost"
DATABASE = "postgres"

engine = create_engine(f"{SGBD}://{USER}:{SENHA}@{HOST}/{DATABASE}")
conn = engine.connect()

query = """
SELECT
    c.nome,
    AVG(p.preco) AS "Média"   
FROM prova.produtos_categorias AS pc
LEFT JOIN prova.produtos AS p ON pc.produto_id = p.id
LEFT JOIN prova.categorias AS c ON pc.categoria_id = c.id

GROUP BY c.nome

ORDER BY c.nome
"""
df = pd.read_sql_query(query, con = conn)
df

          nome       Média
0    Alimentos    2.156667
1  Eletrônicos  549.990000
2       Roupas   39.990000

### Inserções, alterações e remoções de objetos e dados em um banco de dados postgres

**6) Com o objetivo de demonstrar o seu conhecimento através de um exemplo contextualizado com o dia-a-dia da escola, utilize os comandos do subgrupo de funções DDL para construir o banco de dados simples abaixo, que representa um relacionamento do tipo 1,n entre as entidades "aluno" e "turma":**

Tabela 1

Nome da tabela: aluno
Colunas da tabela: id_aluno (INT), nome_aluno (VARCHAR), aluno_alocado (BOOLEAN), id_turma (INT)

Tabela 2

Nome da tabela: turma
Colunas da tabela: id_turma (INT), código_turma (VARCHAR), nome_turma (VARCHAR)

In [ ]:
CREATE TABLE prova.aluno (
    id_aluno INTEGER, 
    nome_aluno VARCHAR(40),
    aluno_alocado BOOLEAN, 
    id_turma INTEGER
);

CREATE TABLE prova.turma (
    id_turma INTEGER, 
    codigo_turma VARCHAR(10),
    nome_turma VARCHAR(20)
);

**7) Agora que você demonstrou que consegue ser mais do que um simples usuário do banco de dados, mostre separadamente cada um dos códigos DML necessários para cumprir cada uma das etapas a seguir:**

*a) Inserir pelo menos duas turmas diferentes na tabela de turma;*

In [ ]:
INSERT INTO prova.turma (id_turma, codigo_turma, nome_turma)
VALUES (1, '31415', 'Matemática'),
       (2, '2718', 'Física');

*b) Inserir pelo menos 1 aluno alocado em cada uma destas turmas na tabela aluno (todos com NULL na coluna aluno_alocado);*

In [ ]:
INSERT INTO prova.aluno (id_aluno, nome_aluno, id_turma)
VALUES (1, 'Vinícius','1'),
       (2, 'Rogério', '2');

*c) Inserir pelo menos 2 alunos não alocados em nenhuma turma na tabela aluno (todos com NULL na coluna aluno_alocado);*

In [ ]:
INSERT INTO prova.aluno (id_aluno, nome_aluno)
VALUES (3, 'Lucas'),
       (4, 'Pedro');

*d) Atualizar a coluna aluno_alocado da tabela aluno, de modo que os alunos associados a uma disciplina recebam o valor True e alunos não associdos a nenhuma disciplina recebam o falor False para esta coluna.*

In [20]:
# SGBD://USER:SENHA@HOST/DATABASE

SGBD = "postgresql+psycopg2"
USER = "postgres"
SENHA = "123"
HOST = "localhost"
DATABASE = "postgres"

engine = create_engine(f"{SGBD}://{USER}:{SENHA}@{HOST}/{DATABASE}")
conn = engine.connect()

query = """
SELECT 
    nome_aluno,
    id_turma,
    CASE 
        WHEN id_turma IS NOT NULL THEN TRUE
        ELSE FALSE
    END AS aluno_alocado
FROM prova.aluno;
"""
df = pd.read_sql_query(query, con = conn)
df

  nome_aluno  id_turma  aluno_alocado
0   Vinícius       1.0           True
1    Rogério       2.0           True
2      Lucas       NaN          False
3      Pedro       NaN          False